# GetComponentTextWidth

## Description
Retrieves the static text's width in Layout Manager Units.

```pascal
FUNCTION GetComponentTextWidth(
				nDialogID           : LONGINT;
				nComponentID        : LONGINT;
				VAR nWidthInLMUnits : INTEGER) : BOOLEAN;
```

```python

def vs.GetComponentTextWidth(nDialogID, nComponentID):
    return (BOOLEAN, nWidthInLMUnits)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT||
|nComponentID|LONGINT||
|nWidthInLMUnits|INTEGER||

## Version
Availability: from VectorWorks 2008
## Category
* Dialogs - Modern